class FAQSection {
    constructor() {
        document.addEventListener('DOMContentLoaded', () => {
            let questions = document.querySelectorAll('.FAQ-1, .FAQ-2, .FAQ-3');

            questions.forEach((question) => {
                question.addEventListener('click', () => {
                    questions.forEach((otherQuestion) => {
                        if (otherQuestion !== question) {
                            let otherAnswer = otherQuestion.nextElementSibling;
                            otherAnswer.classList.remove('open-answer');
                        }
                    });

                    let answer = question.nextElementSibling;
                    answer.classList.toggle('open-answer');
                });
            });
        });
    }
    
    render() {
        const FAQSection = document.createElement('section');
        FAQSection.id = "FAQ-section"
        FAQSection.innerHTML = `
            <link rel="stylesheet" href="components/FAQ/faq.css">
            <div class="FAQ-container">
            <div class="FAQ-head">
                <span>ხშირად დასმული კითხვები</span>
                <a href="#">ყველა კითხვა</a>
            </div>
            <div class="FAQ-questions">
                <div class="FAQ-1">
                    <span>როგორ ხდება კურსებზე რეგისტრაცია და შერჩევა?</span>
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"><path class="arrowDown" d="M8.14644661,10.1464466 C8.34170876,9.95118446 8.65829124,9.95118446 8.85355339,10.1464466 L12.4989857,13.7981758 L16.1502401,10.1464466 C16.3455022,9.95118446 16.6620847,9.95118446 16.8573469,10.1464466 C17.052609,10.3417088 17.052609,10.6582912 16.8573469,10.8535534 L12.4989857,15.2123894 L8.14644661,10.8535534 C7.95118446,10.6582912 7.95118446,10.3417088 8.14644661,10.1464466 Z"></path></svg>
                </div>
                <div class="FAQ-1-answer">
                    <span>კურსზე რეგისტრაციისთვის უნდა გაიარო რამდენიმე ეტაპი:</span>
                    <span><b>I ეტაპი</b> - პირველ ეტაპზე საჭიროა, შეავსო სასურველი კურსისთვის განკუთვნილი სარეგისტრაციო ფორმა, რომელიც განთავსებულია კურსის შიდა გვერდზე. კურსზე რეგისტრაციის დასრულების შემდეგ დაიწყება შემოსული განცხადებების გადარჩევა. </span>
                    <span><b>II ეტაპი</b> - შერჩევის მეორე ეტაპი კურსების მიხედვით განსხვავებულია, ზოგიერთი კურსისთვის მოიცავს პრე-ტესტს, ზოგიერთ კურსზე კი უნარების ტესტს, სადაც მინიმალური ზღვარის გადალახვის შემთხვევაში გადახვალ შერჩევის შემდეგ ეტაპზე.</span>
                    <span><b>III ეტაპი</b> - მესამე ეტაპი კურსების მიხედვით განსხვავდება: Advance კურსებზე, სადაც მოითხოვება გარკვეული ტექნიკური ცოდნა, მონაწილეებმა უნდა დაწერონ ტექნიკური ტესტი ცოდნის დონის შესამოწმებლად, ხოლო კურსებზე, სადაც რაიმე ტიპის წინასწარი ცოდნა მოთხოვნილი არ არის უნდა შეასრულოთ ტექნიკური დავალება, რაც თქვენი კვლევისა და თვითსწავლის უნარს ამოწმებს.</span>
                    <span><b>IV ეტაპი</b> - შერჩევის ბოლო მეოთხე ეტაპი მოიცავს გასაუბრებას შესარჩევ კომისიასთან. გასაუბრების წარმატებით გავლის შემთხვევაში ჩაირიცხებით კურსზე და გაფორმდება შესაბამისი ხელშეკრულება.</span>
                    <span>* სანამ კურსზე დარეგისტრირდები მნიშვნელოვანია, ყურადღებით წაიკითხო კურსის აღწერა, ნახო რას ისწავლი კურსის განმავლობაში და გაიგო გააჩნია თუ არა კურსს დასწრების წინაპირობა. </span>
                </div>
                <div class="FAQ-2">
                    <span>შემიძლია თუ არა ერთზე მეტ კურსზე რეგისტრაცია?</span>
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"><path class="arrowDown" d="M8.14644661,10.1464466 C8.34170876,9.95118446 8.65829124,9.95118446 8.85355339,10.1464466 L12.4989857,13.7981758 L16.1502401,10.1464466 C16.3455022,9.95118446 16.6620847,9.95118446 16.8573469,10.1464466 C17.052609,10.3417088 17.052609,10.6582912 16.8573469,10.8535534 L12.4989857,15.2123894 L8.14644661,10.8535534 C7.95118446,10.6582912 7.95118446,10.3417088 8.14644661,10.1464466 Z"></path></svg>
                </div>
                <div class="FAQ-2-answer">
                    <span>TBC X USAID ტექნოლოგიური განათლებისთვის პროგრამაში თითოეულ კანდიდატს აქვს მხოლოდ ერთი კურსის გავლის შესაძლებლობა. გარდა Information Security და Python კურსებისა, სადაც Basic დონის გავლის შემდეგ შესაძლებელია სწავლის გაგრძელება Advance დონეზე.</span>
                </div>
                <div class="FAQ-3">
                    <span>რა ღირს სწავლა პროგრამის ფარგლებში?</span>
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"><path class="arrowDown" d="M8.14644661,10.1464466 C8.34170876,9.95118446 8.65829124,9.95118446 8.85355339,10.1464466 L12.4989857,13.7981758 L16.1502401,10.1464466 C16.3455022,9.95118446 16.6620847,9.95118446 16.8573469,10.1464466 C17.052609,10.3417088 17.052609,10.6582912 16.8573469,10.8535534 L12.4989857,15.2123894 L8.14644661,10.8535534 C7.95118446,10.6582912 7.95118446,10.3417088 8.14644661,10.1464466 Z"></path></svg>
                </div>
                <div class="FAQ-3-answer">
                    <span>TBC X USAID ტექნოლოგიური განათლებისთვის პროგრამაში თითოეულ კანდიდატს აქვს მხოლოდ ერთი კურსის გავლის შესაძლებლობა. გარდა Information Security და Python კურსებისა, სადაც Basic დონის გავლის შემდეგ შესაძლებელია სწავლის გაგრძელება Advance დონეზე.</span>
                </div>
            </div>
            <a class="more-btn-responsive" href="#">ყველა კითხვა</a>
        </div>
        `;

        return FAQSection;
    }

    
}

export default FAQSection;
